# MakeCutterForPlanRegionsGStepFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutterFailures..::..MakeCutterForPlanRegionsGStepFailed Property
BuiltInFailures..::..CutterFailures Class See Also
---
Failed to make cutter for plan view with plan regions. Try deleting one or more plan regions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MakeCutterForPlanRegionsGStepFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MakeCutterForPlanRegionsGStepFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MakeCutterForPlanRegionsGStepFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutterFailures Class
Autodesk.Revit.DB Namespace